sagaertj/CAN-Stepper-LPC11C24/motor.c
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "LPC11xx.h"                            /* LPC11xx definitions        */

#include "constan.h"
#include "types.h"
#include "motor.h"
#include "main.h"

volatile long timer1count;
volatile int  timer1done;

volatile status_t stepstat ;
volatile systemcfg_t systemconfig ;

//#define USEV1

void setup_motorIO(void)
{
	LPC_SYSCON->SYSAHBCLKCTRL |=  (1UL << 10);    /* enable power to Timer32_1 */
	
	LPC_IOCON->R_PIO1_1=0xc3;							//	STEP CT32B1_M0 mode for IO pin P1_1 
	LPC_IOCON->PIO3_3=0xc0;								// DIR output		
	
	LPC_IOCON->PIO3_2=0xf0;								// Home 1 input (hys + pu)
	LPC_IOCON->PIO1_10=0xf0;							// Home 2 input (hys + pu)
	
	LPC_IOCON->PIO3_1=0xc0;								// SLEEP
	LPC_IOCON->PIO2_6=0xc0;								// STPDIS
	
	LPC_IOCON->PIO0_7=0xc0;								// led1 
	LPC_IOCON->PIO3_0=0xc0;								// led2
	LPC_IOCON->PIO1_8=0xc0;								// led3

	LPC_IOCON->PIO2_7=0xf0;								// F1 
	LPC_IOCON->PIO2_8=0xf0;								// F2
	LPC_IOCON->PIO2_10=0xf0;							// F3
	
	LPC_GPIO0->DIR=0x80;
	LPC_GPIO1->DIR=0x102;
	LPC_GPIO2->DIR=0x40;
	LPC_GPIO3->DIR=0xb;
	
		
	//setup timer 0
	// timer 0 clock source=PCLK edge
	LPC_TMR32B1->CTCR=0;
	// timer 0 prescaler register	 ( om te delen door 15 : 14 invullen)
	LPC_TMR32B1->PR=14;	 //resolutie 1us
	
	LPC_TMR32B1->EMR=0 ;	

	// reset on match en interrupt
	LPC_TMR32B1->MCR=MCR_MR0R | MCR_MR0I ;
	
	//t0 Match on value clock=15000000
	LPC_TMR32B1->MR0=999;
	
	LPC_TMR32B1->TCR=TCR_RESET ;	//stop & reset 
	
	//enable TIMER_32_1_IRQ in NVIC
	NVIC_EnableIRQ(TIMER_32_1_IRQn);
}

void init_motorvars(void)
{
	stepstat.homingdone=FALSE;
	stepstat.targetpos=0;
	stepstat.accel=DEFAULT_ACC; 
	stepstat.decel=DEFAULT_DEC;
	stepstat.v_max=DEFAULT_SPEED;
	stepstat.backlash=0;

	stepstat.newposrequest=FALSE;
	stepstat.currentpos=0;
	stepstat.running=FALSE;
	stepstat.stopreq=FALSE;
	stepstat.recalc_after_stop=FALSE;
	
	stepstat.toholdpowertimer=0;
}

void process_serialdata(char * serial_buffer)
{
	char *token;
	char seps[] = " ";
	
	token = strtok((char *) serial_buffer, seps );
	if( token != NULL )
	{
		if (0==strncmp(token,"hm",2))
		{
			printf ("to home\r\n");
			stepstat.targetpos=0;
			DoMotorRun();
		}
		else if (0==strncmp(token,"nh",2))
		{
			printf ("setting current pos new homepos\r\n");
			stepstat.currentpos=0;
			//stepstat.newtargetpos=stepstat.currentpos;
		}
		else if (0==strncmp(token,"init",4))
		{
			printf ("initialize defaults\r\n");
			FindHomePosition();
		}
		else if (0==strncmp(token,"cw",2))
		{
			printf ("run forward (CW)\r\n");
			DoContineousRun(CW);
		}
		else if (0==strncmp(token,"ccw",3))
		{
			printf ("run backward (CCW)\r\n");
			DoContineousRun(CCW);
		}
		else if (0==strncmp(token,"stop",4))
		{
			printf ("stopping\r\n");
			StopMotor();
		}
		else if (0==strncmp(token,"ma",2))				 // move absolute
		{
			long pos;
			token = strtok( NULL, seps );
			if (token==NULL)		  // geen locatie nummer opgegeven
				goto error;
			pos=atol(token);

			if (stepstat.targetpos!=pos || stepstat.targetpos!=stepstat.currentpos ) //we want a new target position 
			{				  
				while(stepstat.newposrequest!=FALSE);	//wacht tot request is verwerkt
				//while(stepstat.recalc_after_stop);
				
				//	if(stepstat.newposrequest==FALSE && stepstat.run_state!=DECEL)
				//	while(stepstat.run_state==DECEL);// && (  (stepstat.currentpos-stepstat.newtargetpos) < -20  ||  (stepstat.currentpos-stepstat.newtargetpos) > 20) );
				//if(stepstat.newposrequest==FALSE)
				//{
				
				//if(stepstat.run_state==DECEL)
				//{
					  //stepstat.newtargetpos=pos;
				//}

				//if ((stepstat.currentpos-pos)<-2  || (stepstat.currentpos-pos)>2)	
				//if(stepstat.run_state!=ACCEL)
				//if(stepstat.run_state!=DECEL)
				//{
					stepstat.recalc_after_stop=FALSE;
					if (stepstat.running)
					{
						//stepstat.recalc_after_stop=FALSE;
						stepstat.newtargetpos=pos;
						//deze laatst zetten (irq)
						stepstat.newposrequest=TRUE;
					}	
					else
					{
						stepstat.newtargetpos=pos;
						stepstat.targetpos=pos;
						DoMotorRun();
					}
				//}
			}
		}
		else if (0==strncmp(token,"sy",2))//continue to last target position
		{
			//printf ("syncing real with last job position\r\n");
			DoMotorRun();
		}
		else if (0==strncmp(token,"j+",2)) //jog 1 step CW
		{
			//printf ("1 step forward\r\n");
			stepstat.targetpos+=1;
			DoMotorRun();
		}
		else if (0==strncmp(token,"j-",2)) //jog 1 step CCW
		{
			//printf ("1 step backward\r\n");
			stepstat.targetpos-=1;
			DoMotorRun();
		}
		else if (0==strncmp(token,"J+",2)) //rel 10 steps CW
		{
			//printf ("1 step forward\r\n");
			stepstat.targetpos+=10;
			DoMotorRun();
		}
		else if (0==strncmp(token,"J-",2))	//rel 10 steps CCW
		{
			//printf ("1 step backward\r\n");
			stepstat.targetpos-=10;
			DoMotorRun();
		}
		else if (0==strncmp(token,"mr",2))	//relative move
		{
			int rel;
			token = strtok( NULL, seps );
			if (token==NULL)
				goto error;		  
			rel=atoi(token);
			stepstat.targetpos+=rel;
			printf ("relative move %i\r\n",rel);
			DoMotorRun();
		}
		else if (0==strncmp(token,"ac",2))	//set acceleration
		{
			int acc;
			token = strtok( NULL, seps );
			if (token==NULL)
				goto error;
			acc=atoi(token);
			if ((acc>500000)||(acc<=0))
			   goto error;
			stepstat.accel=acc;
			//printf ("set acceleration %i\r\n",acc);
		}
		else if (0==strncmp(token,"de",2))	//set decelleration
		{
			int dec;
			token = strtok( NULL, seps );
			if (token==NULL)
				goto error;
			dec=atoi(token);
			if ((dec>500000)||(dec<=0))
			   goto error;
			stepstat.decel=dec;
			printf ("set deceleration %i\r\n",dec);
		}
		else if (0==strncmp(token,"ad",2))	// set accel and deceleration
		{
			int dec;
			token = strtok( NULL, seps );
			if (token==NULL)
				goto error;
			dec=atoi(token);
			if ((dec>500000)||(dec<=0))
			   goto error;
			stepstat.accel=stepstat.decel=dec;
			printf ("set deceleration %i\r\n",dec);
		}
//				else if (0==strncmp(token,"bl",2))
//				{
//					int v;
//					token = strtok( NULL, seps );
//					if (token==NULL)
//						goto error;
//					v=atoi(token);
//					if ((v>1000)||(v<0))
//					   goto error;
//					stepstat.backlash=v;
//					printf ("set backlash %i\r\n",v);
//				}
		else if (0==strncmp(token,"vm",2))	//set vMax
		{
			int v;
			token = strtok( NULL, seps );
			if (token==NULL) goto error;
			v=atoi(token);
			if ((v>5000000)||(v<0))
			   goto error;
			stepstat.v_max=v;
			printf ("set vmax %i\r\n",v);
		}
		else if (0==strncmp(token,"ver",3)) //show version
		{
			printf("version %s %s\r\n",SWVERSION,SWDATE ); 
		}
		else if (0==strncmp(token,"sh",2))
		{
			printf ("position      %li\r\n",stepstat.targetpos );
			printf ("real position %li\r\n",stepstat.currentpos ); 
			printf ("backlash      %i\r\n",stepstat.backlash);
			printf ("vmax          %i\r\n",stepstat.v_max);
			printf ("acceleration  %li\r\n",stepstat.accel);
			printf ("deceleration  %li\r\n",stepstat.decel);
			printf ("state         %i\r\n",stepstat.run_state);
			printf ("runstate      %i\r\n",stepstat.running);
			printf ("decel_val     %li\r\n",stepstat.decel_val);
			printf ("decel_start   %li\r\n",stepstat.decel_start);
			printf ("step_count   %li\r\n",stepstat.step_count);
			printf ("accel_count  %li\r\n",stepstat.accel_count);				

			printf ("=====================\r\n");
		}
		else if (0==strncmp(token,"p?",2))	//show current position
		{
			printf ("real position %li\n",stepstat.currentpos ); 
		}
		else
			goto error;

