sagaertj/CAN-Stepper-LPC11C24/motor.c
		goto noerrors;
		
		error:
		printf("command error\n");
		noerrors:
		;
	}
	else
		printf("ready\r\n");
	
}
/***************************************************
* Reads the limit switch 
****************************************************/
static byte GetHomeSwitch(void)
{
	//FIO0MASK1=~HOME_0_MASK;
	//return FIO0PIN1 & HOME_0_MASK;
	return LPC_GPIO3->MASKED_ACCESS [HOME_0_MASK]==HOME_0_MASK;
}



void FindHomePosition(void)
{
	stepstat.homingdone=FALSE;
	//achteruit tot switch schakelt
	
	stepstat.currentpos=0;
	stepstat.accel=DEFAULT_ACC; 
	stepstat.decel=DEFAULT_DEC; 
	stepstat.v_max=systemconfig.homing_speed; 
 	stepstat.currentpos=0;
	
	//homing limit and direction
	stepstat.targetpos=systemconfig.home_detection_steplimit;

	//draaien
	DoMotorRun();
	
	//tot de homeswitch schakelt
	while(GetHomeSwitch());
	
	StopMotor();

	stepstat.currentpos=0;
	stepstat.targetpos=0;

	printf("Detected SWITCH ON\n\r");

	//dan traag terugkeren tot de switch ontschakelt
	do 
	{
		stepstat.targetpos+=1;
		DoMotorRun();
		while(stepstat.running);
	}
	while(GetHomeSwitch()==0);

	//als het schakelmoment niet op de 0 staat, dan hier de juiste waarde invullen
	stepstat.currentpos=systemconfig.homing_offset;//positie van homing switch tov nullpunt
	stepstat.homingdone=TRUE;

	printf("Homing done\n\r");
	//vooruit to switch ontschakeld
}



void Set_MotorPower(enum POWERSTATE powermode)
{
	static enum POWERSTATE prevpowermode;

	if (prevpowermode==powermode)
		return;

	prevpowermode=powermode;
 	
	switch(powermode)
	{
		case POWEROFF:
			//set io
			break;
		case HOLDMODE:
			//set io
			break;
		case FULLPOWER:
			//set io

			//wait
			timer1done=0;
			timer1count=FULLPOWERDELAY;
			while(!timer1done);
			break;
		default:
			break;
	}
}

__inline void Set_Motor_Direction(int dir)
{
	if (dir==CCW)
	{
		//ccw OUTPUT HIGH	 (p0.22)
		//FIO0MASK2=0xbf;
		//FIO0PIN2=0x40;
		LPC_GPIO3->MASKED_ACCESS[0x08]= 0x08;
	}
	else
	{
		//ccw OUTPUT low	(p0.22)
		//FIO0MASK2=0xbf;
		//FIO0PIN2=0x00;
		LPC_GPIO3->MASKED_ACCESS[0x08]= 0x00;
	}
}


 __inline  void Step_Motor(void)
{
  	//step pulse word door MAT02 pin gegenereerd
	//indien geen MAT hw pin gebruikt word dan de code hieronder gebruiken
	//Step output high. (p0.23)
	//FIO0MASK2=0x7f;
	//FIO0PIN2=0x80;

	//Step output low. (p0.23)
	//FIO0MASK2=0x7f;
	//FIO0PIN2=0x00;

	// huidige positie bijhouden
	if(stepstat.dir==CW)
		stepstat.currentpos++;
	else
		stepstat.currentpos--;

	stepstat.step_count++;
}

void StopMotor(void)
{
	stepstat.stopreq=TRUE;	
 	while (stepstat.running);

	//save power
	Set_MotorPower(HOLDMODE);
}

void DoContineousRun(enum DIRECTION dir)
{
	if (dir==CCW)
		stepstat.targetpos=0x7fffffffUL;
	else
		stepstat.targetpos=0x80000000UL;
		
	DoMotorRun();
}

/*! \brief Move the stepper motor a given number of steps.
 *
 *  Makes the stepper motor move the given number of steps.
 *  It accelrate with given accelration up to maximum speed and decelerate
 *  with given deceleration so it stops at the given step.
 *  If accel/decel is to small and steps to move is to few, speed might not
 *  reach the max speed limit before deceleration starts.
 *
 *  step  Number of steps to move (pos - CW, neg - CCW).
 *  accel  Accelration to use, in 0.01*rad/sec^2.
 *  decel  Decelration to use, in 0.01*rad/sec^2.
 *  speed  Max speed, in 0.01*rad/sec.
 */
void DoMotorRun(void)
{
	long relativesteps;
	  
	//! Number of steps before we must start deceleration (if accel does not hit max speed).
	unsigned long accel_lim;

	if (stepstat.running)
	{
		return;
	}

	stepstat.newtargetpos=stepstat.targetpos;
 
	relativesteps=stepstat.targetpos-stepstat.currentpos;

	// Set direction from sign on step value.
	if(relativesteps < 0)
	{
		stepstat.dir = CCW;
		Set_Motor_Direction(CCW);
	 	relativesteps = -relativesteps; // positief getal van maken.

//		if (stepstat.backlash)
//		{
//			relativesteps+=stepstat.backlash;	// bij achteruit draaien ,iets doordraaien en dan terugkeren
//		}
	}
	else if(relativesteps > 0)
	{
		stepstat.dir = CW;
		Set_Motor_Direction(CW);
	}
	else //niets te doen bij relativesteps is 0
		return;

	Set_MotorPower(FULLPOWER);
	
	//berekenen en onthouden
	stepstat.start_step_delay = (T1_FREQ_148 * sqrt(A_SQ / stepstat.accel)    )/100;
	stepstat.step_delay=stepstat.start_step_delay;
	
	// Reset counter.
	stepstat.accel_count = 0;
	stepstat.running = TRUE;

	LPC_TMR32B1->TCR=TCR_RESET;	//reset
	LPC_TMR32B1->EMR=EMR_EMC0_CLR ;
 
	// If moving only 1 step.
  	if(relativesteps == 1)
  	{
		// Move one step...
		stepstat.accel_count = -1;
		// ...in DECEL state.
		stepstat.run_state = DECEL;
		// Just a short delay so main() can act on 'running'.
		LPC_TMR32B1->MR0=stepstat.start_step_delay;
	}
  	else// if(step != 0)	  Only move if number of steps to move is not zero.
  	{
		LPC_TMR32B1->MR0=10;// moet minimum 2 zijn !! anders komt de match pin niet hoog ! niet tegenstaande er toch een irq is.	 geen idee van de reden.

		// Refer to documentation for detailed information about these calculations.
		
		// Set max speed limit, by calc min_delay to use in timer.
		// min_delay = (alpha / tt)/ w
		//stepstat.min_delay = T1_FREQ / vmax; //maw de max snelheid in usteps/s
		
		//orig
		stepstat.min_delay = A_T_x100 / stepstat.v_max; //maw de max snelheid in usteps/s

		//	printf("stepstat.min_delay=%i\n\r",stepstat.min_delay);
		
		// Set accelration by calc the first (c0) step delay .
	
		//	printf("stepstat.initial_delay=%i\n\r",stepstat.step_delay);

		// Find out after how many STEPS does the speed hit the max speed limit.
		// max_s_lim = speed^2 / (2*alpha*accel)
		stepstat.max_s_lim = (long)stepstat.v_max*stepstat.v_max/(long)(((long)A_x20000*stepstat.accel)/100);
		// If we hit max speed limit before 0,5 step it will round to 0.
		// But in practice we need to move atleast 1 step to get any speed at all.
		if(stepstat.max_s_lim == 0)
		{
      	stepstat.max_s_lim = 1;
    	}
		//printf("max_s_lim=%i\n\r",max_s_lim);
		
		// Find out after how many steps we must start deceleration.
		// n1 = (n1+n2)decel / (accel + decel)
		//kans op overflow !!!!
		//accel_lim = ((long)step*decel) / (accel+decel);	//	step * 180000 / 185000

		//voorkomt overflow door gebruik 64 bit long long
		accel_lim = ((long long)relativesteps*stepstat.decel) / (stepstat.accel+stepstat.decel);	//	(4000 * 180000) / (5000 + 180000 )

		// We must accelrate at least 1 step before we can start deceleration.
		if(accel_lim == 0)
		{
			accel_lim = 1;
		}
		//	printf("accel_lim=%i\n\r",accel_lim);

