sagaertj/CAN-Stepper-LPC11C24/motor.c
	   // Use the limit we hit first to calc decel.
		if(accel_lim <= stepstat.max_s_lim)
		{
		   stepstat.decel_val = accel_lim - relativesteps;	 //driehoek profiel
			//printf("stepstat.decel_val=%i\n\r",stepstat.decel_val);
 	   }
	   else
		{
			stepstat.decel_val = - ((stepstat.max_s_lim*stepstat.accel)/stepstat.decel);	//trapezium profiel
			//printf("STEPstat.decel_val=%i\n\r",stepstat.decel_val);
	   }

	   // We must decelrate at least 1 step to stop.
	   if(stepstat.decel_val == 0)
		{
	   	stepstat.decel_val = -1;
	   }

	   // Find step to start decleration.	decel_cal is altijd negatief
	   stepstat.decel_start = relativesteps + stepstat.decel_val;

		//printf("stepstat.decel_start=%i\n\r",stepstat.decel_start);
	
	    // If the maximum speed is so low that we dont need to go via accelration state.
		if(stepstat.step_delay <= stepstat.min_delay)
		{
	      stepstat.step_delay = stepstat.min_delay;
	      stepstat.run_state = RUN;
	  	}
	  	else
		{
			stepstat.run_state = ACCEL;
		}
   }

	LPC_TMR32B1->TCR=TCR_RUN;		//run
}


void DoMotorRun2(void)
{
	long relativesteps=stepstat.targetpos-stepstat.currentpos;

	//unsigned int vmax=stepstat.v_max;
	  
	//! Number of steps before we hit max speed.
	//unsigned long max_s_lim;
	//! Number of steps before we must start deceleration (if accel does not hit max speed).
	unsigned long accel_lim;

	LPC_TMR32B1->TCR=TCR_RESET;	//reset 
 
	// Set direction from sign on step value.
	if(relativesteps < 0)
	{
		stepstat.dir = CCW;
		Set_Motor_Direction(CCW);
	 	relativesteps = -relativesteps; // positief getal van maken.

		if (stepstat.backlash)
		{
			relativesteps+=stepstat.backlash;	// bij achteruit draaien ,iets doordraaien en dan terugkeren
		}
	}
	else if(relativesteps > 0)
	{
		stepstat.dir = CW;
		Set_Motor_Direction(CW);
	}
	else
	{  
		//zorgtvoor 1 extra int.
		LPC_TMR32B1->MR0=stepstat.step_delay; 
		// go for it :Start Timer
		LPC_TMR32B1->TCR=TCR_RUN;		//run
		//niets te doen bij relativesteps is 0
		return;
	}
	// Reset counter.
	stepstat.accel_count = 0;

	//startsnelheid berekenen
	stepstat.step_delay=stepstat.start_step_delay;

	// If moving only 1 step.
  	if(relativesteps == 1)
  	{
		// Move one step...
		stepstat.accel_count = -1;
		// ...in DECEL state.
		stepstat.run_state = DECEL;
	}
  	// Only move if number of steps to move is not zero.
  	else// if(step != 0)
  	{
		accel_lim = ((long long)relativesteps*stepstat.decel) / (stepstat.accel+stepstat.decel);	//	(4000 * 180000) / (5000 + 180000 )

		// We must accelrate at least 1 step before we can start deceleration.
		if(accel_lim == 0)
			accel_lim = 1;

	   // Use the limit we hit first to calc decel.
		if(accel_lim <= stepstat.max_s_lim)
		{
		   stepstat.decel_val = accel_lim - relativesteps;
 	   }
	   else
		{
			stepstat.decel_val = - ((stepstat.max_s_lim*stepstat.accel)/stepstat.decel);
	   }

	   // We must decelrate at least 1 step to stop.
	   if(stepstat.decel_val == 0)
	   	stepstat.decel_val = -1;

	   // Find step to start decleration.	decel_cal is altijd negatief
	   stepstat.decel_start = relativesteps + stepstat.decel_val;
  	
	    // If the maximum speed is so low that we dont need to go via accelration state.
		if(stepstat.step_delay <= stepstat.min_delay)
		{
	      stepstat.step_delay = stepstat.min_delay;
	      stepstat.run_state = RUN;
	  	}
	  	else
		{
			stepstat.run_state = ACCEL;
		}
   }

	//bijna direct irq als we de timer starten
	LPC_TMR32B1->MR0=10; 

	// go for it :Start Timer
 	LPC_TMR32B1->TCR=TCR_RUN;		//run
}


/*! \brief Timer/Counter1 Output Compare A Match Interrupt.
 *
 *  Timer/Counter1 Output Compare A Match Interrupt.
 *  Increments/decrements the position of the stepper motor
 *  exept after last position, when it stops.
 *  The \ref step_delay defines the period of this interrupt
 *  and controls the speed of the stepper motor.
 *  A new step delay is calculated to follow wanted speed profile
 *  on basis of accel/decel parameters.
 */

//	Timer Match Interrupt.
void TIMER32_1_IRQHandler( void )
{
	volatile int i;//voor dummy delay loop
	
	// Holds next delay period.
	long new_step_delay=0;
	// Remember the last step delay used when accelrating.
	static unsigned long last_accel_delay;
	
	// Keep track of remainder from new_step-delay calculation to increase accurancy
	static long rest = 0;
	
	long relativesteps2;
	long relativesteps;
	unsigned long accel_lim;

  	//reset the int flag
	if ((LPC_TMR32B1->IR & 1)==1 )
		LPC_TMR32B1->IR=1; 

	if(stepstat.step_delay>stepstat.start_step_delay)
		stepstat.step_delay=stepstat.start_step_delay;
	
	//the next delay is setup in advance in the match register
	LPC_TMR32B1->MR0= stepstat.step_delay;

eval:

	switch(stepstat.run_state)
	{
//		case DOBACKLASH:
//			if(step_count==stepstat.backlash)
//			{
//				stepstat.run_state = STOP;
//			}
//			else
//			{
//			    Step_Motor();
//			}
//			new_step_delay=stepstat.step_delay ;
//	     	break;
		case RUN:
			Step_Motor();
			new_step_delay = stepstat.min_delay;

			//herbereken decel_start
			if(stepstat.newposrequest)
			{
				stepstat.newposrequest=FALSE;
							
				//herberekenen van  decel_val bij dezlfde richting
				if(stepstat.dir==CW )
				{
					//hebben we nog genoeg ruimte over om af te remmen ?
					if ((stepstat.currentpos-stepstat.newtargetpos) <  stepstat.decel_val)
					{
						//decel_start punt verder leggen
						//stepstat.decel_start= stepstat.decel_start+(stepstat.newtargetpos-stepstat.targetpos);

						relativesteps=stepstat.newtargetpos-stepstat.currentpos;
		 
		 				accel_lim = ((long long)relativesteps*stepstat.decel) / (stepstat.accel+stepstat.decel);	//	(4000 * 180000) / (5000 + 180000 )

					   // Use the limit we hit first to calc decel.
						if(accel_lim <= stepstat.max_s_lim)
						{
						   stepstat.decel_val = accel_lim - relativesteps;
				 	   }
					   else
						{
							stepstat.decel_val = - ((stepstat.max_s_lim*stepstat.accel)/stepstat.decel);
					   }
				
					   // We must decelrate at least 1 step to stop.
					   if(stepstat.decel_val == 0)
					   	stepstat.decel_val = -1;
				
					   // Find step to start decleration.	decel_cal is altijd negatief
					   stepstat.decel_start = relativesteps + stepstat.decel_val;
  						stepstat.step_count = 0;
					}
					else
					{
						//nieuwe target ligt in huidig decel gebied dus (of in andere richting) direct beginnen vertragen met de 
						stepstat.accel_count = stepstat.decel_val;
						// Start decelration with same delay as accel ended with.
						new_step_delay = last_accel_delay;
						stepstat.run_state = DECEL;
						stepstat.recalc_after_stop=TRUE;
					}
				}
				else	// CCW
				{
					if ((stepstat.newtargetpos-stepstat.currentpos) <  stepstat.decel_val)
					{
						//decel_start verder leggen
						//stepstat.decel_start=stepstat.decel_start-(stepstat.newtargetpos-stepstat.targetpos);

