sagaertj/CAN-Stepper-LPC11C24/motor.c
						relativesteps=stepstat.currentpos-stepstat.newtargetpos;
		 
		 				accel_lim = ((long long)relativesteps*stepstat.decel) / (stepstat.accel+stepstat.decel);	//	(4000 * 180000) / (5000 + 180000 )

					   // Use the limit we hit first to calc decel.
						if(accel_lim <= stepstat.max_s_lim)
						{
						   stepstat.decel_val = accel_lim - relativesteps;
				 	   }
					   else
						{
							stepstat.decel_val = - ((stepstat.max_s_lim*stepstat.accel)/stepstat.decel);
					   }
				
					   // We must decelrate at least 1 step to stop.
					   if(stepstat.decel_val == 0)
					   	stepstat.decel_val = -1;
				
					   // Find step to start decleration.	decel_cal is altijd negatief
					   stepstat.decel_start = relativesteps + stepstat.decel_val;
  						stepstat.step_count = 0;
					}
					else
					{
						//we moeten omkeren want we zijn te ver om nog af te remmen
						stepstat.accel_count = stepstat.decel_val;
						// Start decelration with same delay as accel ended with.
						new_step_delay = last_accel_delay;
						stepstat.run_state = DECEL;
						stepstat.recalc_after_stop=TRUE;
					}
				}
				stepstat.targetpos=stepstat.newtargetpos;
				break;
			} //if (newposrequest)
			// Check if we should start decelration.
			if(stepstat.step_count >= stepstat.decel_start || stepstat.stopreq)
			{
				stepstat.stopreq=FALSE;
				stepstat.accel_count = stepstat.decel_val;
				// Start decelration with same delay as accel ended with.
				new_step_delay = last_accel_delay;
				stepstat.run_state = DECEL;
			}
			break;
  		case STOP:
//			if (stepstat.dir == CCW && stepstat.backlash >0)
//			{
//				long step=stepstat.backlash;
//   
//   			// identiek stuk zoals de initiele berekening.
//				
//				stepstat.step_count=0;
//				rest = 0;
//				T0TCR=TCR_STOP;
//				
//				stepstat.dir = CW;
//				Set_Motor_Direction(stepstat.dir);
//				
//				stepstat.step_delay=stepstat.start_step_delay;
//
//				accel_lim = ((long)step*stepstat.decel) / (stepstat.accel+stepstat.decel);
//				if(accel_lim == 0)
//					accel_lim = 1;
//				
//				if(accel_lim <= stepstat.max_s_lim)
//				{
//				   stepstat.decel_val = accel_lim - step;
//				}
//				else
//				{
//					stepstat.decel_val = - ((stepstat.max_s_lim*stepstat.accel)/stepstat.decel);
//				}
//				
//				if(stepstat.decel_val == 0)
//					stepstat.decel_val = -1;
//				
//				stepstat.decel_start = step + stepstat.decel_val;
//				
//				if(stepstat.step_delay <= stepstat.min_delay)
//				{
//				   stepstat.step_delay = stepstat.min_delay;
//				   stepstat.run_state = RUN;
//				}
//				else
//				{
//				   stepstat.run_state = ACCEL;
//				}
//				
//				// Reset counter.
//				stepstat.accel_count = 0;
//				
//				//stepstat.running = TRUE;
//				T0MR0=0; //korte tijd om timer te starten
//				// Start Timer
//				T0TCR=TCR_RESET;	//reset 
//				T0TCR=TCR_RUN;		//run
//				VICVectAddr = 0;  // Acknowledge Interrupt
//				//stepstat.cmdbusy=FALSE;
//				return ;
//				//goto ok;
//			}
//			else //gewoon zonder backlash
			{
				if(stepstat.recalc_after_stop)
			 	{
			 		stepstat.recalc_after_stop=FALSE;
					stepstat.step_count = 0;
					rest = 0;
					DoMotorRun2();
					new_step_delay=stepstat.step_delay;
					break;
				}
				else
				{
					if(stepstat.newposrequest)
					{
						stepstat.targetpos=stepstat.newtargetpos;
						stepstat.newposrequest=0;
						stepstat.step_count = 0;
						rest = 0;
		 				DoMotorRun2();
						new_step_delay=stepstat.step_delay;
						break;
					}	
					else
					{
						// Stop Timer
						LPC_TMR32B1->TCR=TCR_RESET; //impliceert TCR_STOP
						stepstat.step_count = 0;
						rest = 0;
						stepstat.running = FALSE;
						//clear pin en Disable Match Pin
						LPC_TMR32B1->EMR=0;
					}
				}
			}
			break;
	
		case ACCEL:
			Step_Motor();
 
			stepstat.accel_count++;
			new_step_delay = stepstat.step_delay - ((long)((2 * stepstat.step_delay) + rest)/(4 * stepstat.accel_count + 1));
			rest = (long)((2 * stepstat.step_delay)+rest)%(4 * stepstat.accel_count + 1);
			//stepstat.step_delay=new_step_delay;

//			index=stepstat.accel_count;
//			if (index<LUTSIZE)
//			{
//				new_step_delay=lut[index];
//				if (index>0)
//					stepstat.step_delay=lut[index-1];
//			}
			
			if(stepstat.stopreq)
			{
				stepstat.stopreq=FALSE;
				stepstat.accel_count =-stepstat.step_count;
				stepstat.run_state = DECEL;
				//last_accel_delay = stepstat.step_delay;
				new_step_delay = last_accel_delay;
				break;
			}

			if(stepstat.newposrequest)
			{
				stepstat.newposrequest=FALSE;
				//herberekenen van  decel_val bij dezlfde richting
				if(stepstat.dir==CW )
				{
					//ligt de nieuwe positie verder ?
					if (stepstat.currentpos<stepstat.newtargetpos)
					{
						//opnieuw berekenen decel punt en reking houden met reeds afgelegde weg
						  
						//! Number of steps before we must start deceleration (if accel does not hit max speed).
					 						
						relativesteps=stepstat.newtargetpos-stepstat.currentpos;
					
						accel_lim = ((long long)relativesteps*stepstat.decel) / (stepstat.accel+stepstat.decel);	//	(4000 * 180000) / (5000 + 180000 )
				
						// We must accelrate at least 1 step before we can start deceleration.
						if(accel_lim == 0)
							accel_lim = 1;
				
					   // Use the limit we hit first to calc decel.
						if(accel_lim <= stepstat.max_s_lim)
						   stepstat.decel_val = accel_lim - relativesteps;
					   else
							stepstat.decel_val = - ((stepstat.max_s_lim*stepstat.accel)/stepstat.decel);
				
					   // We must decelrate at least 1 step to stop.
					   if(stepstat.decel_val == 0)
					   	stepstat.decel_val = -1;
				
					   // Find step to start decleration.	decel_cal is altijd negatief
					   stepstat.decel_start = relativesteps + stepstat.decel_val;
						stepstat.decel_start+= stepstat.accel_count;

					   // If the maximum speed is so low that we dont need to go via accelration state.
						if(stepstat.step_delay <= stepstat.min_delay)
						{
					      stepstat.step_delay = stepstat.min_delay;
					      stepstat.run_state = RUN;
					  	}
					}
					else //OK	vertragen en omkeren
					{
						//nieuwe target ligt in huidig decel gebied dus (of in andere richting) direct beginnen vertragen,bij het stoppen worden de nieuwe punten berekend.
						stepstat.accel_count =-stepstat.step_count;
						stepstat.step_count=0;
						stepstat.run_state = DECEL;
						stepstat.recalc_after_stop=TRUE;
						//break;
					}
				}
				else	// CCW
				{
					if (stepstat.newtargetpos < stepstat.currentpos)
					{
						//opnieuw berekenen decel punt en reking houden met reeds afgelegde weg
						  
						//! Number of steps before we must start deceleration (if accel does not hit max speed).
	 						
