sagaertj/CAN-Stepper-LPC11C24/motor.c
						relativesteps=stepstat.currentpos-stepstat.newtargetpos;	 //omgekeerd als bij CW	 rest is hetzelfde
					
						accel_lim = ((long long)relativesteps*stepstat.decel) / (stepstat.accel+stepstat.decel);	//	(4000 * 180000) / (5000 + 180000 )
		
						// We must accelrate at least 1 step before we can start deceleration.
						if(accel_lim == 0)
							accel_lim = 1;
				
					   // Use the limit we hit first to calc decel.
						if(accel_lim <= stepstat.max_s_lim)
						   stepstat.decel_val = accel_lim - relativesteps;
					   else
							stepstat.decel_val = - ((stepstat.max_s_lim*stepstat.accel)/stepstat.decel);
				
					   // We must decelrate at least 1 step to stop.
					   if(stepstat.decel_val == 0)
					   	stepstat.decel_val = -1;
				
					   // Find step to start decleration.	decel_cal is altijd negatief
					   stepstat.decel_start = relativesteps + stepstat.decel_val;
						stepstat.decel_start+= stepstat.accel_count;
					
					    // If the maximum speed is so low that we dont need to go via accelration state.
						if(stepstat.step_delay <= stepstat.min_delay)
						{
					      stepstat.step_delay = stepstat.min_delay;
					      stepstat.run_state = RUN;
					  	}
					}
					else	//OK	vertragen en omkeren
					{
						//nieuwe target ligt in huidig decel gebied dus (of in andere richting) direct beginnen vertragen 
						stepstat.accel_count =-stepstat.step_count;
						stepstat.step_count=0;
						
						stepstat.recalc_after_stop=TRUE;
						//break;
					}
				}
				stepstat.targetpos=stepstat.newtargetpos;
			}
			else	//normale gang van zaken
			{
				// Check if we should start decelration.
				if(stepstat.step_count >= stepstat.decel_start )
				{
					stepstat.accel_count = stepstat.decel_val;
					stepstat.run_state = DECEL;
					stepstat.step_count=0;	//ccccccccccccccccccccccccccccccccccccccccccccccccc
				}
				// Check if we hitted max speed.
				else if(new_step_delay <= stepstat.min_delay)
				{
					last_accel_delay = new_step_delay;
					new_step_delay = stepstat.min_delay;//max speed
					stepstat.run_state = RUN;
				}
			}
			break;

		case DECEL:
			Step_Motor();
  		   stepstat.accel_count++;			//negatief getal -> -> 0
			if(stepstat.accel_count == 0)//laatste stop voor het einde
			{
				new_step_delay = stepstat.start_step_delay ;
				rest=0;
			}
			else
			{
				new_step_delay = stepstat.step_delay - ((long)((2 * stepstat.step_delay) + rest)/(4 * stepstat.accel_count + 1));
				rest = (long)((2 * stepstat.step_delay)+rest)%(4 * stepstat.accel_count + 1);
			}

			if(stepstat.newposrequest)
			{
				stepstat.newposrequest=FALSE;
								
				//herberekenen van  decel_val bij dezlfde richting
				if(stepstat.dir==CW )
				{
					//ligt het nieuwe eindpunt verder dan het huidige ?
					if (stepstat.newtargetpos>(1+(stepstat.currentpos - stepstat.accel_count)))	 //accel count is negatief !
					{
						//opnieuw berekenen decel punt en reking houden met reeds afgelegde weg
						relativesteps=stepstat.newtargetpos-stepstat.currentpos;
						//unsigned long accel_lim;
						
						  
						stepstat.accel_count=-stepstat.accel_count;
						
#ifdef USEV1		 		  		
						relativesteps2= relativesteps - stepstat.accel_count + ((stepstat.accel_count * (stepstat.accel + stepstat.decel)) / stepstat.decel);
#else
						//accel_lim= ((long long)relativesteps*decel) / (accel+decel);
						//accel_lim= relativesteps - accel_lim;
						//of
						//accel_lim= ((long long)relativesteps*accel) / (accel+decel);
						relativesteps2= relativesteps + 	((stepstat.accel_count * stepstat.decel) /stepstat.accel);
#endif						
						accel_lim = ((long long)relativesteps2*stepstat.decel) / (stepstat.accel+stepstat.decel);
						// We must accelrate at least 1 step before we can start deceleration.
						if(accel_lim == 0)
							accel_lim = 1;

					   // Use the limit we hit first to calc decel.
						if(accel_lim <= (stepstat.max_s_lim))
						{
							//driehoek
#ifdef USEV1
		 					stepstat.decel_val =	-accel_lim;	  //v1
#else
							stepstat.decel_val = accel_lim - relativesteps2;//v2
#endif
						}
					   else
						{
							stepstat.decel_val = - ((stepstat.max_s_lim*stepstat.accel)/stepstat.decel);  //trapezium
						}

					   // We must decelrate at least 1 step to stop.
					   if(stepstat.decel_val == 0)
					   	stepstat.decel_val = -1;
		  						
					   // Find step to start decleration.	decel_cal is altijd negatief
	   				stepstat.decel_start = relativesteps + stepstat.decel_val;
						stepstat.step_count=0;

						stepstat.step_delay=new_step_delay;
						new_step_delay = stepstat.step_delay - ((long)((2 * stepstat.step_delay) + rest)/(4 * stepstat.accel_count + 1));
						rest = (long)((2 * stepstat.step_delay)+rest)%(4 * stepstat.accel_count + 1);

						stepstat.run_state = ACCEL;
					}
					else if (stepstat.newtargetpos<(stepstat.currentpos - stepstat.accel_count))	//	OK blijven vertragen en bij het stoppen heberekenen en omkeren
					// if (stepstat.newtargetpos<=(stepstat.currentpos - stepstat.accel_count))	//	OK blijven vertragen en bij het stoppen heberekenen en omkeren
					{
						stepstat.recalc_after_stop=TRUE;
					}
//					else
//					{
//						 stepstat.run_state = STOP;
//					}
				}
				else	// CCW
				{
					if ((stepstat.newtargetpos)<(stepstat.currentpos + stepstat.accel_count-1))
					{
						relativesteps=stepstat.currentpos-stepstat.newtargetpos;
						//opnieuw berekenen decel punt en reking houden met reeds afgelegde weg
												  
						stepstat.accel_count=-stepstat.accel_count;

#ifdef USEV1
					   relativesteps2= relativesteps - stepstat.accel_count + ((stepstat.accel_count * (stepstat.accel + stepstat.decel)) / stepstat.decel);
#else
						relativesteps2= relativesteps + 	((stepstat.accel_count * (long)stepstat.decel) /stepstat.accel);
#endif
		  				accel_lim = ((long long)relativesteps2*stepstat.decel) / (stepstat.accel+stepstat.decel);
						// We must accelrate at least 1 step before we can start deceleration.
						if(accel_lim == 0)
							accel_lim = 1;
											
