sagaertj/CAN-Stepper-LPC11C24/motor.c
				      // Use the limit we hit first to calc decel.
						if(accel_lim <= (stepstat.max_s_lim))
						{
						  	//driehoek
#ifdef USEV1
		 					stepstat.decel_val =	-accel_lim;	 //v1
#else
							stepstat.decel_val = accel_lim - relativesteps2;	  //v2
#endif
						}
					   else
						{
							stepstat.decel_val = - ((stepstat.max_s_lim*stepstat.accel)/stepstat.decel);  //trapezium
						}

					 	// We must decelrate at least 1 step to stop.
					   if(stepstat.decel_val == 0)
					   	stepstat.decel_val = -1;

	  			   	// Find step to start decleration.	decel_cal is altijd negatief
						stepstat.decel_start = relativesteps + stepstat.decel_val;
	  					stepstat.step_count=0;

						stepstat.step_delay=new_step_delay;
						new_step_delay = stepstat.step_delay - ((long)((2 * stepstat.step_delay) + rest)/(4 * stepstat.accel_count + 1));
						rest = (long)((2 * stepstat.step_delay)+rest)%(4 * stepstat.accel_count + 1);
						
						stepstat.run_state = ACCEL;
					}
					else if (stepstat.newtargetpos>(stepstat.currentpos + stepstat.accel_count))//	OK blijven vertragen en omkeren
					{
						stepstat.recalc_after_stop=TRUE;
					}
				}
				stepstat.targetpos=stepstat.newtargetpos;	
			}
			//else	//normale gang van zaken
			// Check if we are at last step
		   {
				if(stepstat.accel_count >= 0)
			   {
					stepstat.run_state = STOP;
					goto eval;
 			   }
			}
		   break;
	}

	if (stepstat.run_state!=STOP)
	 	LPC_TMR32B1->EMR=EMR_EMC0_CLR;		//clear en re-arm	
	else
		LPC_TMR32B1->EMR=0;				 		//clear en disable	
	
	stepstat.step_delay = new_step_delay;
	stepstat.toholdpowertimer=TOHOLDPOWERDELAY;
}


/***************************************************
 *
 * sqrt routine 'grupe', from comp.sys.ibm.pc.programmer
 * Subject: Summary: SQRT(int) algorithm (with profiling)
 *    From: warwick@cs.uq.oz.au (Warwick Allison)
 *    Date: Tue Oct 8 09:16:35 1991
 *
 *  \param x  Value to find square root of.
 *  \return  Square root of x.
 ***************************************************/
static unsigned long sqrt(unsigned long x)
{
	unsigned long xr;  		// result register
	unsigned long q2;  		// scan-bit register
	unsigned char f;   		// flag (one bit)

	xr = 0;                	// clear result
	q2 = 0x40000000L;       // higest possible result bit
	do
	{
		if((xr + q2) <= x)
		{
			x -= xr + q2;
			f = 1;            // set flag
		}
		else
		{
			f = 0;            // clear flag
		}
		xr >>= 1;
		if(f)
		{
			xr += q2;     		// test flag
		}
	}
	while(q2 >>= 2);        // shift twice

	if(xr < x)
  	{
   	return xr +1;        // add for rounding
  	}
  	else
  	{
    	return xr;
  	}
}



